[
    {
        "name": "Barbarian",
        "subtypes": [
            {
                "name": "Path of the Souleater",
                "desc": "Spreading from a fringe sect among Sudvall's minotaur Knights of the Horn, souleaters deliberately infect themselves with a non-contagious variant of the ravening. The disease doesn't harm them, nor can it be removed; instead it empowers them. These barbarians consume souls to gain the power of their foes. Souleaters walk the knife's edge between martial power and carnivorous madness.\n\n##### Souleater\nWhen you choose this path at 3rd level, you carry a dormant version of the ravening disease. When you reduce a beast, giant, humanoid, or monstrosity to 0 hit points with a successful attack, you can consume a portion of the creature's soul, gaining temporary hit points equal to the creature's CR + your Constitution modifier (minimum 1).\nWhen you consume a new soul, you can replace the benefits of the previous soul. Benefits from this feature last until you finish raging. You gain additional benefits from Souleater as you progress on this path.\n\n##### Shield of the Soul\nAt 6th level, you can use your Souleater ability on aberration, elementals, and fey. In addition, when consuming a soul, you can choose to gain one of the creature's damage resistances, damage immunities, or condition immunities as your own.\n\n##### Bonebreaker\nAt 10th level, you can use your Souleater ability on celestials, dragons, and fiends. In addition, when consuming a soul, your weapon attacks gain bonus damage equal to the creature's highest ability modifier (your choice).\n\n##### Invincible\nAt 14th level, you instinctively absorb a consumed soul to preserve your own life. If you have consumed a soul with your Souleater ability and drop to 0 hit points, the benefits from Souleater end and you immediately regain hit points equal to the soul's CR + your Constitution modifier."
            }
        ]
    },
    {
        "name": "Bard",
        "subtypes": [
            {
                "name": "College of the Sky",
                "desc": "The aeromancers of the sky-city of Aerdvall use their magic to keep the city afloat and protect it from the dangers that threaten it. They have no time for the day- to-day administration of the region. That's where the bards of the College of the Sky come in. These bards are also proficient with the magic of the element of air, but they act as the face of the city's power, dealing with the citizens and visitors alike.\n\n#### Bonus Proficiencies\nWhen you join the College of the Sky at 3rd level, you gain proficiency with one of the following skills of your choice: Arcana, Nature, and Persuasion skills. In addition, levitate, gust of wind, and fly are considered bard spells for you.\n\n#### Gusting Inspiration\nAlso at 3rd level, your study of aeromancy allows you to affect the movement and position of your allies on the battlefield. As a bonus action, you can control the winds to affect a creature that you can see and that has one of your Bardic Inspiration dice and has not yet used it. You can either move the creature 10 feet along the ground or stand the creature up from prone. If the creature is grappled, you must succeed on a spell attack roll against the escape DC to move it.\n\n#### Swirling Breeze\nStarting at 6th level, you can use the power of the wind to keep attackers away from you. When a creature moves adjacent to you, you can use a reaction to summon a windstorm around you. The triggering creature must succeed on a Strength (Athletics) check against your spell DC. On a failed check, the creature is pushed back 10 feet and can't move closer to you until the start of its next turn. You can use this feature a number of times equal to your Charisma modifier, and you regain expended uses when you finish a long rest. You can expend a 1st-level spell slot as a bonus action to regain one use of this feature.\n\n#### Crushing Wind\n At 14th level, you have mastered the powerful and dark art of driving the air from the lungs of your foes. As an action, choose one creature that is Large or smaller within 30 feet of you that you can see. The target must succeed on a Constitution saving throw against your spell DC. On a failure, the target takes 6d10 force damage and is incapacitated. At the start of each of your turns, you can use your action to maintain the effect. The affected target can attempt a new saving throw at the end of each of its turns, as well as each time it takes damage from anything other than this effect.\nOnce you use this feature, you can't use it again until you finish a long rest."
            }
        ]
    },
    {
        "name": "Cleric",
        "subtypes": [
            {
                "name": "Cat Domain",
                "desc": "You embody the grace, strength, and resilience of felines. Eventually, you gain the ability to take the form of a lion or a tiger.\n\n**Cat Domain Spells**\n| Level | Spells                                              | \n|-------|-----------------------------------------------------|\n| 1st   | _find familiar_ (feline only)_, speak with animals_ |\n| 3rd   | _animal messenger, pass without trace_              |\n| 5th   | _bestow curse, nondetection_                        |\n| 7th   | _dimension door, locate creature_                   |\n| 9th   | _commune with nature, mislead_                      |\n\n#### Silent Claws\nWhen you choose this domain at 1st level, you learn the true strike cantrip and you gain proficiency in Acrobatics and Stealth.\n\n#### Channel Divinity: Feline Finesse\nAt 2nd level, you can use your Channel Divinity to add a +10 bonus to a single Dexterity ability check or Dexterity-based skill check made by you or someone you designate within 30 feet. Doing this takes no action on your turn or a reaction when it's not your turn. You make this choice after you see the roll but before the GM says whether the check succeeds or fails.\n\n#### Eyes of the Cat\nBeginning at 6th level, you gain darkvision out to a range of 60 feet. If you already have darkvision, the range becomes 90 feet.\n\n#### Divine Strike\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n#### Emissary of the Cat\nAt 17th level, you become a natural lycanthrope. You use the statistics of a weretiger, though your form can be that of a werelion, werepanther, wereleopard, or other large cat, whichever is appropriate for your deity. Your alignment doesn't change as a result of this lycanthropy, and you can't spread the disease of lycanthropy."
            },
            {
                "name": "Perfume Domain",
                "desc": "You are an initiate into the mysteries of spice, pheromones, and scent. The Queen of Perfumes, mighty Bastet, grants you the power to heal the body, seduce the mind, or destroy the soul.\n\n**Perfume Domain Spells**\n| Level | Spells |\n|-------|--------|\n| 1st | _charm person, heroism_ |\n| 3rd | _prayer of healing, stinking cloud_ |\n| 5th | _fear, gaseous form_ |\n| 7th | _confusion, phantasmal killer_ |\n| 9th | _cloudkill, dream_ |\n\n#### Alchemist\nWhen you choose this domain at 1st level, you gain proficiency in Nature, alchemist's supplies, and herbalism kits. You learn the guidance cantrip, and if you burn a small amount of incense while casting it, its range becomes 30 feet instead of touch.\n\n#### Channel Divinity: Alluring Fragrance\nStarting at 2nd level, you can use your Channel Divinity as an action to gesture with your holy symbol. Each creature of your choice within 30 feet that can breathe is charmed by you until the end of your next turn or until it takes damage. A successful Wisdom saving throw negates the charm effect. While charmed, creatures are friendly to you and your allies. \nAt 14th level, you can use this feature on creatures that don't need to breathe.\n\n#### Channel Divinity: Restorative Breath\nStarting at 6th level, as a reaction when you fail a saving throw, you can use your Channel Divinity to add a +5 bonus to the result.\n\n#### Potent Spellcasting\nBeginning at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.\n\n#### Olfactory Domination\nAt 17th level, you gain the ability to beguile an enemy's mind and make it your servant. While creatures are charmed by your Alluring Fragrance ability, you can take a bonus action on your turn to verbally order them to take a specific action on their next turns, as per the command spell but with no saving throw. You can affect a number of charmed creatures equal to your Wisdom modifier (minimum 1)."
            },
            {
                "name": "Speed Domain",
                "desc": "In speed and skill there is power, and you serve your faith by engaging in acts of incredible quickness and agility. Eventually you become able to control time itself.\n\n**Speed Domain Spells**\n| Level | Spells |\n|-------|--------|\n| 1st | _expeditious retreat, feather fall_ |\n| 3rd | _blur, web_ |\n| 5th | _haste, slow_ |\n| 7th | _conjure minor elementals, dimension door_ |\n| 9th | _hold monster, teleportation circle_ |\n\n#### Celerity in Thought and Action\nWhen you choose this domain at 1st level, your speed increases by 5 feet, and you gain proficiency in Acrobatics and Insight.\n\n#### Channel Divinity: Burst of Speed\nBeginning at 2nd level, you can use your Channel Divinity to grant yourself or another creature greater speed. When you use an action to touch a creature, the target adds 10 feet to its walking speed. It also gains the benefit of a bless spell, but only on attacks and saving throws that rely on Dexterity. This effect lasts for a number of rounds equal to 3 + your Wisdom modifier.\n\n#### Quickness of the Gods\nAt 6th level, your speed increases by another 5 feet. Also, as a reaction or a bonus action, you can increase your Dexterity modifier by +5 until the end of your current turn. This benefit can be used for all purposes except attack rolls. Once you use this feature, you can't use it again until you finish a long rest.\n\n#### Divine Strike\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n#### Channel Divinity: Time Stop\nAt 17th level, you can use your Channel Divinity to stop the flow of time. The effect is identical to the time stop spell; you can take three turns in a row when the effect is triggered. You must finish a long rest before using this ability again."
            }
        ]
    },
    {
        "name": "Druid",
        "subtypes": [
            {
                "name": "Circle of the Desert",
                "desc": "Druids who join the Circle of the Desert are as harsh and unforgiving as the sands of Nuria-Natal. Cross them and the desert itself rises against you. Be generous with them and the desert reveals its bounty.\n\n#### The Desert Provides\nAt 2nd level when you choose this circle, you gain the ability to cast create or destroy water without expending a spell slot or material components. Once you have used this ability you can't use it again until you finish a short or long rest.\nAt 6th level you may use this feature to instead cast create food and water.\n\n#### Heatwave\n Also at 2nd level, when a creature takes fire damage from a cantrip that you cast, you can choose one creature within 10 feet of your target. That creature takes fire damage equal to your Wisdom modifier (minimum 1).\n\n#### One with the Sands\nStarting at 2nd level, your body has become adapted to the ferocious desert. You can go twice as long without water, gain advantage on saving throws against exhaustion due to heat or lack of water, and are not slowed by difficult terrain caused by sand.\nAt 14th level, you become immune to exhaustion caused by heat or lack of water.\n\n#### Guardian of Dust\nBeginning at 6th level, you can expend one use of your Wild Shape feature as an action to summon a spirit of the desert. It takes the shape of a dust devil and surrounds you for 1 hour, until you fall unconscious, or you dismiss the spirit. The spirit occupies the same space as you and moves with you. While it is active, ranged weapon attacks against you have disadvantage, and creatures that strike you with natural weapons take 1d8 + your Wisdom modifier (minimum 0) bludgeoning damage from the buffeting wind. You suffer no damage from its swirling winds.\n\n#### Light of the Sun\nStarting at 10th level, when you cast a spell that deals fire or radiant damage, you can add your Wisdom modifier (minimum 0) to one damage roll. Targets that take damage shed bright light in a 5-foot radius and dim light for an additional 5 feet until the end of your next turn.\n\n#### Crashing Dune\nUpon reaching 14th level, as an action you can conjure up a wave of sand under your feet that rushes forward, affecting creatures in a 30-foot square. Each creature other than you in that area must make a Dexterity saving throw equal to your spell save DC. On a failed save, a creature takes 4d8 bludgeoning damage, is knocked prone, and is pushed to the edge of the wave. On a successful save, a creature takes half as much damage and is not knocked prone or pushed. You can ride the wave, allowing it to push you to its end. Once you have used this ability, you can't use it again until you finish a short or long rest."
            },
            {
                "name": "Circle of the Jungle",
                "desc": "The druids of the High Jungles belong to a circle that embraces the Green Walker's desire to grow. Much like their vine lords, they seek to spread the green.\n\n#### Plant Form\nAt 2nd level when you choose this circle, you receive the Green Walker's blessing, gaining the ability to transform into dangerous plants with a challenge rating as high as 1. Starting at 6th level, you can transform into a plant with a challenge rating as high as your druid level divided by 3.\n\n#### Vine Speak\nStarting at 2nd level, when you cast a druid cantrip and hit a creature with a spell attack or the target fails its saving throw, the target's speed is halved until the beginning of your next turn as it is slowed by grasping vines.\n\n#### Rending Thorns\nBeginning at 6th level, you can cover your body in razor-sharp thorns coated in a sticky poison. By expending a 1st-level spell slot as a bonus action, you sprout thorns that cause your natural attacks to deal an additional 1d4 poison damage for 1 minute. When using a spell slot of 2nd level or higher, the damage increases by 1d4 for each slot level above 1st. You can use this feature using Wild Shape.\n\n#### Verdant Body\nStarting at 10th level, your body takes on some of the characteristics of a plant. As long as you have ample sun and water, you don't need to eat. You gain blindsense to a range of 15 feet and resistance to damage done by nonmagical piercing weapons. When not wearing armor, your woody skin gives you an Armor Class equal to 14 + your Dexterity modifier.\n\n#### Mind-Warping Spores\nBeginning at 14th level, you can exhale a cloud of spores as an action. One creature of your choice within 15 feet of you must roll a Constitution saving throw against your spell save DC. If the creature fails, it takes psychic damage equal to your druid level each time it attacks you or casts a hostile spell that includes you as a target. This lasts for 1 minute or until you use this feature on another creature. A creature that is immune to the charmed condition is immune to this feature."
            }
        ]
    },
    {
        "name": "Fighter",
        "subtypes": [
            {
                "name": "Havoc Runner",
                "desc": "The deserts of Nuria Natal and the Dominion of the Wind Lords are hazardous to travelers, particularly merchants carrying valuable cargo. The gnolls of the desert wastes assault even the swiftest and most heavily defended caravans using tactics that have been adopted by reavers and raiders of every race that prey upon the trade routes. The sight of one havoc runner makes any experienced merchant captain blanch. The sight of an entire troop of them is enough to make one insensible with terror.\n\n#### Gauging Glance\nBeginning at 3rd level, you can Search as a bonus action on your turn, and you gain proficiency in your choice of either Investigation or Perception.\n\n#### Cry Havoc\nAlso at 3rd level, you gain two Havoc dice, which are d6s. You can use one of these dice in the following ways:\n- When you make an attack against a creature with advantage, you can roll your Havoc die and add the result to your attack roll.\n- When you have advantage on an attack against a creature and hit, you can roll your Havoc die and add the result to your damage roll.\n- When you are the target of an attack and within 5 feet of a creature friendly to you, you can roll your Havoc die and subtract the result from the attack roll.\n- When you hit with an opportunity attack and a creature that is hostile to your target is within 5 feet of your target, you can roll your Havoc die and add twice its result to your damage roll.\n- When you grapple or shove a creature, you can roll your Havoc die and add the result to your ability check.\nWhen you roll a 5 or 6 on a Havoc die, and when you roll a critical hit, you immediately gain an additional Havoc die. You can expend one Havoc die per trigger. You regain expended Havoc dice at the start of your turn. You lose all but one Havoc die when you make no attack rolls against hostile creatures for 1 minute.\n\n#### Lightning Lope\nBeginning at 7th level, your movement speed increases by 10 feet. When you start your movement with no hostile creatures within 5 feet and end your movement with at least one hostile creature within 5 feet, you have advantage on the first attack roll you make before the end of your turn.\n\n#### Havoc in Action\nStarting at 10th level, if you have four or more Havoc dice at the start of your turn, you can remove three dice from your Havoc dice pool to add 10 to the damage you deal with your next successful attack. You can't use this feature more than once per attack. Dice you remove from your pool with this feature are not regained at the start of your next turn.\n\n#### Work As One\nBeginning at 15th level, when you and a creature friendly to you that is not incapacitated are within 5 feet of your target, you can grapple or shove your target regardless of its size. If it is one size larger than you or smaller, it has disadvantage on ability checks it rolls to avoid or escape grapples and shoves by you and creatures friendly to you.\n\n#### Lightning Strike Starting at 18th level, when you use your Action Surge, you can reroll all results of a 1 on a Havoc die until the end of this turn. You must use the new result."
            },
            {
                "name": "Sword Dancer",
                "desc": "Sword-dancers blur the line between warrior and courtier. The first sword-dancers hailed from the sultan's court in the city of Siwal in the Southlands. Sword-dancers are graceful and charming, with wits as sharp as their flashing blades. Fighters who follow the sword-dancer archetype often attach themselves to powerful lords as bodyguards, spies, and diplomats.\n\n#### Bonus Proficiency\nBeginning at 3rd level, you gain proficiency in the Performance and Persuasion skills.\n\n#### Light on Your Feet\nAlso at 3rd level, while wearing light or no armor, you can add your Charisma modifier (minimum of 1) to your Armor Class, and you ignore difficult terrain.\n\n#### Dust on the Wind\nStarting at 7th level, when you make a melee attack against a creature, you don't provoke opportunity attacks from that creature until the start of your next turn.\n\n#### Deadly Artistry\nAt 10th level, after you move at least 10 feet, your melee attacks deal an additional 1d8 damage until the start of your next turn.\n\n#### Howling Edge of the Razor\nStarting at 15th level, as a reaction when you take damage from a creature within 5 feet of you, you can make one melee weapon attack against that creature.\n\n#### Teeth of Khamsin\nAt 18th level, when you take the Attack action, you can use the Dash action as a bonus action. When you Dash in this way, attack rolls made against you have disadvantage until the start of your next turn.\nYou can use this feature twice, and you regain all expended uses when you finish a short or long rest."
            },
            {
                "name": "Tunnel Watcher",
                "desc": "For untold ages, the dwarves have paid in blood to keep their subterranean homes safe. The keystone to the defense of the dwarven citadels are the tunnel watchers, warriors trained in the tight, uneven paths of the Underworld. Given their importance to the defense of Sebbek Sobor and the other dwarven holds, numbers of dwarven tunnel watchers outside the holds are few but not unknown.\nWhile the techniques of the tunnel watchers originated with the dwarves, others see the value in such specialization. Tunnel watchers can thus be found throughout the mountainous regions of Midgard.\n\n#### First Line of Defense\nAt 3rd level when you choose this subclass, a creature that you hit with a weapon attack has its speed reduced by 15 feet and can't use the Disengage action until the start of your next turn. When you hit a creature with an opportunity attack, you deal an additional 1d8 damage.\n\n#### Fight for Every Step\nAs a reaction when you take damage from a melee attack, you can move 5 feet away from the attacker onto non-difficult terrain, reducing the damage you take by 1d6 + the number of hostile creatures currently in reach of you. This movement doesn't provoke opportunity attacks.\nThe attacker can immediately move into the space you evacuated. This doesn't cost the attacker's reaction and doesn't provoke opportunity attacks, but a creature can only move this way once per turn.\n\n#### When the Watcher's Away\nAt 3rd level, you gain proficiency with thieves' tools and mason's tools.\n\n#### Safe Passage\nStarting at 7th level, you have advantage on saving throws against traps, natural hazards, and lair actions. Traps, natural hazards, and lair actions have disadvantage when they make attack rolls against you.\n\n#### Steadfast\nBeginning at 10th level, you gain advantage on saving throws against effects that cause the frightened condition and effects that would move you against your will, including teleportation effects. When a hostile creature forces you to roll a Strength saving throw and you succeed, you deal an additional 1d8 weapon damage the next time you hit with a weapon attack before the end of your next turn.\n\n#### Cave-In\nStarting at 15th level, when you use the Attack action on your turn, you can replace one attack per turn with striking a wall or ceiling within your weapon's reach or range. Creatures other than you within 5 feet of the section of wall or the floor below the ceiling where you strike must roll a Dexterity saving throw against a DC equal to 8 + your proficiency bonus + your choice of your Strength or Dexterity modifier. A creature that fails this saving throw takes 2d10 bludgeoning damage and is restrained until the end of its next turn, but also gains three-quarters cover against creatures other than you. On a success, the creature takes half damage and there is no further effect. When the restrained effect ends, one 5-foot square of that creature's space becomes difficult terrain.\n\n#### Against the Tide\nBeginning at 18th level, when you hit more than one creature with weapon attacks on your turn, you can use your bonus action to gain resistance to bludgeoning, piercing, and slashing damage until the beginning of your next turn. When you shove more than one creature on your turn, each creature that you shoved is knocked prone, and you can make an extra shove attack against one creature within 5 feet of a creature you shoved."
            }
        ]
    },
    {
        "name": "Paladin",
        "subtypes": [
            {
                "name": "Oath of the Chosen",
                "desc": "The Oath of the Chosen creates a bond between the paladin and the god Aten, and to Nuria Natal, the land of his chosen people. Other adherents of the faith refer to these paladins as bright blades or shining lords. Members of the order spend their time countering threats to Nuria Natal and preventing the Mharoti from gaining a foothold in the east. With that threat currently at low ebb, bright blades now patrol the roads running along the River Nuria as well as the trade routes in the Crescent and Sarklan deserts.\n\n#### Tenets of the Chosen\nAten is a strict patron who demands his chosen adhere tothe following tenets:\n**_Defend the Land._** Scour all threats to Nuria Natal before they corrupt the holy land.\n**_Defend the People._** A threat to the people of Nuria Natal is a threat to the land itself. Purge the holy land of all that would defile its people.\n**_Defend Your Faith._** Aten is the light of the world. Anything that makes a mockery of you or Aten is a threat to both his chosen land and his chosen people.\n**_Be the People's Beacon._** The lands are rife with corrupting influences. Be the torch that guides the chosen people to enlightenment.\n\n#### Oath Spells\nYou gain oath spells at the paladin levels listed.\n**Oath of the Chosen Spells**\n| Level | Spells |\n|-------|--------|\n| 3rd | _healing word, shield_ |\n| 5th | _augury, scorching ray_ |\n| 9th | _beacon of hope, haste_ |\n| 13th | _guardian of faith, resilient sphere_ |\n| 17th | _flame strike, hallow_ |\n\n#### Channel Divinity\nWhen you take this path at 3rd level, you gain the following two Channel Divinity options.\n**_Cradle of the Land._** When you can see a creature within 60 feet of you that has 0 hit points, you can use your Channel Divinity as a reaction to restore hit points to it. The number of hit points it regains equals 1d8 + any number of hit points that you expend from your Lay on Hands pool.\n**_Star of Sand and Sun._** As a bonus action, you can create a magical glass morningstar in your hand that lasts for 1 minute. On a hit, the weapon deals 1d8 piercing damage plus 1d4 radiant damage and 1d4 force damage. On a critical hit with this weapon, you can choose to deal extra damage as normal for a critical hit, or you can choose for the weapon to shatter. Your target and creatures within 20 feet of them that are hostile to you must roll a Dexterity saving throw against your spell save DC, suffering 4d6 radiant damage and 4d6 force damage on a failure or half damage on a success.\nThe extra damage you deal increases to 2d6 radiant damage and 2d6 force damage at 15th level, and the critical damage from shattering the morningstar increases to 6d6 radiant damage and 6d6 force damage.\nYou can dismiss the weapon on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, the effect ends.\n\n#### Bastion of Force\nBeginning at 7th level, when you hit a creature with a Divine Smite, you or a creature of your choice that you can see within 10 feet have resistance to all damage dealt by that creature until the beginning of your next turn.\nAt 18th level, you can choose a creature within 30 feet.\n\n#### Divine Beacon\nStarting at 15th level, when you use Divine Sense, you can attempt to draw some or all of the celestials, fey, and fiends you detect to you. As a free action, you beckon as many of the creatures as you wish within 60 feet. Each must succeed on a Wisdom saving throw or be compelled to move toward you as fast as they can for their next turn.\n\n#### Vitrified Guardian of the Chosen People\nAt 20 level, as a bonus action, you can take on a translucent, glassy form for 1 minute. While you are in this form, you gain the following:\n- You have resistance to acid, necrotic, and poison damage.\n- You are immune to radiant damage, and when you are the target of a spell that deals radiant damage, you can choose up to two other creatures within 30 feet to be targets of the effect instead.\n- You are immune to the blinded condition.\n- When you use your Lay on Hands or Cradle of the Land features and restore any number of hit points to a creature, you can choose a second creature that you can see within 60 feet to regain an equal number of hit points.\nOnce you use this feature, you can't use it again until you finish a long rest or you expend a 5th-level spell slot to regain the use of it."
            }
        ]
    },
    {
        "name": "Ranger",
        "subtypes": [
            {
                "name": "Jungle Warden",
                "desc": "Some are born to the jungle, while others learn its ways later in life. Jungle Wardens imitate the animals of the jungle in offense and defense. They learn to eat safely, avoiding the spoilage caused by the heat and humidity of the rainforest. The greatest of the Jungle Wardens see the jungle as the wellspring of vibrant life, learning to turn aside necrotic energies. These lessons serve them well in all environments.\n\n#### Jungle Warden Magic\nStarting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Jungle Warden Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.\n **Jungle Warden Spells**\n| Level | Spells | \n|-------|--------|\n| 3rd | _entangle _ |\n| 5th | _spike growth_ |\n| 9th | _stinking cloud_ |\n| 13th | _giant insect_ |\n| 17th | _insect plague_ |\n\n#### Power from the Green\nAt 3rd level when you choose this archetype, you gain one of the following features of your choice.\n**_Jaguar._** When you start your turn hidden, your first successful attack deals an additional 1d8 damage. If you engage in two-weapon fighting this turn, you can add 1d8 to the damage of your second attack as well.\n**_Mountain Gorilla._** When you aren't within reach of any hostile creatures, you can perform a powerful, thundering leap. You spend 2 feet of movement for each foot you move horizontally. You don't take falling damage for your first 20 feet of vertical descent. This movement doesn't provoke opportunity attacks. When you land, one creature within 5 feet of you must roll a Strength saving throw against your ranger spell save DC. On a failure, it takes 1d8 thunder damage and has disadvantage on its first attack roll before the beginning of your next turn.\n**_Poison Dart Frog._** You learn to harvest a poison from certain jungle creatures, which you apply to your weapons. When you hit a creature with a weapon attack, you can choose for it to roll a Constitution saving throw against your ranger spell save DC. On a failure, it takes 1d8 poison damage and is poisoned until the beginning of your next turn. You can use this feature twice and regain the use of it when you roll initiative in a new encounter.\n\n#### Safe Repast\nAlso at 3rd level, you can cast purify food and drink but only as a ritual.\n\n#### Natural Defenses\nStarting at 7th level, you gain one of the following features of your choice.\n**_Jaguar._** When you hit a creature with an attack, it can't make opportunity attacks against you and it has disadvantage on opportunity attacks against other creatures, until the beginning of its next turn.\n**_Mountain Gorilla._** When you are frightened, you can make an additional saving throw against that condition at the start of each of your turns against the original effect DC. On a success, the frightened condition ends, you gain temporary hit points equal to your ranger level, and you gain advantage on attack rolls you make before the beginning of your next turn.\n**_Poison Dart Frog._** You gain resistance to poison damage and advantage on saving throws against the poisoned condition.\n\n#### Warrior of the Green\nBeginning at 11th level, you gain one of the following features of your choice.\n**_Ferocity._** When you are within 5 feet of more hostile creatures than friendly creatures, or when you attack a creature that has legendary actions, your weapon attacks deal an additional 1d8 damage. You can't apply this bonus twice to the same attack.\n**_Cunning._** Once per turn when you have advantage on a weapon attack or the target is poisoned, you can deal an additional 3d6 damage.\n\n#### One with the Green\nStarting at 15th level, you gain resistance to necrotic damage, and when you or a creature within 30 feet of you that you can see takes necrotic damage, you can expend a spell slot as a reaction to negate 2d6 points of necrotic damage per level of the spell slot you expend."
            }
        ]
    },
    {
        "name": "Rogue",
        "subtypes": [
            {
                "name": "Caravan Raider",
                "desc": "Most gnolls of Dabu are talented raiders, but only the best master the alchemical recipes needed to create mojo bags. These raiders leave bedlam in their wake and take what they want in the chaos.\n\n#### Swift Raider\nStarting at 3rd level, your speed increases by 5 feet while you aren't wearing medium or heavy armor. At 9th and again at 13th level, your speed increases by an additional 5 feet.\n\n#### Raider Training\nWhen you choose this archetype at 3rd level, you have advantage on Dexterity (Acrobatics) and Strength (Athletics) checks if at least one of your allies is within 5 feet and the ally isn't incapacitated. In addition, because of your training throwing grenade weapons, you gain a +2 bonus to attack rolls you make with ranged weapons that have the thrown property.\n\n#### Mojo Bags\nAt 9th level, you gain the ability to create two types of alchemical bags that produce surprises when hurled. These items function only for you and last until you finish a long rest. As part of a long rest, you can create a number of bags equal to half your rogue level.\nWhen thrown, the mojo bag detonates in a 10-foot-radius burst and affects all creatures in that area. Mojo bags have a range of 20/60 and the DC for your bags are equal to 8 + your proficiency bonus + your Intelligence modifier.\nChoose your recipes from the list below.\n**_Coward's Wail._** Creatures in the area affected by a coward's wail must succeed on Wisdom saving throw or become frightened for 1 minute. While frightened, they must use the Dash action to move away from you; if they can't, they use the Dodge action. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the effect ends on the target.\n**_Devil's Fire._** A creature hit with devil's fire takes 3d6 fire damage and catches fire, burning for an additional 1d6 fire damage at the end of each of their turns for 1 minute or until they use an action to put out the flames. A creature that succeeds on a Dexterity saving throw takes half damage and doesn't catch fire.\n**_Grasping Tendrils._** Acid-covered tentacles sprout from the bag that last for 1 minute, grasping creatures in the area and forcing them to make a Strength saving throw. Creatures that fail are restrained. While restrained, a creature takes 2d6 acid damage at the end of each of its turns. At the end of each of its turns, the target can make another Strength saving throw. On a success, the effect ends on the target.\n**_Healing Mists._** Creatures in the area when the bag detonates regain 1d6 hit points.\n\n#### Improved Recipe\nStarting at 13th level, choose one recipe you know and increase its effect by 2d6 or its DC by 1. At 17th level, you can improve a second recipe.\n\n#### Shock and Awe\nStarting at 17th level, you learn a third recipe, and enemy creatures have disadvantage on saving throws against your mojo bags that they make during the first round of combat."
            },
            {
                "name": "Grudge Bearer",
                "desc": "The quest to reclaim Haldaheim has brought some rogues into contact with the spirits of long-dead dwarven ancestors there. By accepting the burden of the spirit's grudges, they gain a knowledgeable, if eerie, ally.\n\n#### Spirit Ally\nAt 3rd level when you choose this archetype, the spirit of an ancient dwarf joins with you. Work with your GM to create a name and personality for the spirit. You gain a number of the spirit's capabilities from when it was alive.\n- You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray. If you already have darkvision, the range of your darkvision increases by 30 feet.\n- You gain proficiency in medium armor, and wearing medium armor doesn't impose disadvantage on your Dexterity (Stealth) checks. You can add 3, rather than 2, to your Armor Class while wearing medium armor if your Dexterity is 16 or higher.\n- You speak, read, and write Dwarvish and Deep Speech.\n\n#### Long Memory for Grudges\nAlso at 3rd level, your spirit ally helps you settle scores. You gain advantage on your first attack roll against a creature that dealt damage to you, or that you saw deal damage to any dwarf or another creature that you are friendly toward. On a hit, you deal an additional 1d6 necrotic damage. Once you do, you can't choose to knock that creature unconscious if you reduce them to 0 hit points. You can use this feature a number of times equal to your proficiency bonus. You regain one expended use for each Hit Die you expend to regain hit points and all expended uses when you finish a long rest.\n\n#### Wandering Soul\nStarting at 9th level, your spirit ally can aid in your scouting. As a bonus action, you can see creatures and objects that are in the Ethereal Plane within 60 feet while you are in the Material Plane, and vice versa, until the end of your next turn.\nAs an action, your spirit ally can look through objects up to 5 feet thick and report what it sees. It shares your bonus to Wisdom (Perception) checks and darkvision, and it can see 60 feet into the Ethereal Plane.\n\n#### Stone Mind\nBeginning at 13th level, you learn to block out the whispers in the darkness that shatter the minds of lesser adventurers. You gain resistance to psychic damage.\nAs a reaction, when a creature within 30 feet of you that you can see takes psychic damage, you can halve the damage that creature takes.\n\n#### Inescapable Vengeance\nStarting at 17th level, as a bonus action, you can become invisible until the beginning of your next turn. Until this effect ends, you can pass through creatures and solid objects. You take 1d10 force damage if you end your turn in the same space as another creature or solid object. The first time you hit with a weapon attack, you deal an additional 2d6 necrotic damage.\nYou can use this feature once and regain use of it when you expend a use of Long Memory for Grudges and when you finish a long rest."
            }
        ]
    },
    {
        "name": "Sorcerer",
        "subtypes": [
            {
                "name": "Farseer",
                "desc": "Your magic comes from a god of prophecy and prognostication who imbued a sliver of its power in your ancestry. Farseers can trace their power through the generations to a single, powerful ancestor whose divine gift gave them access to the webs of fate. Others are plagued by visions and omens with no knowledge of their august lineage. These unfortunate men and women may be driven to madness and ostracized by their uncontrolled, forbidden knowledge. Regardless, the touch of the divine has forever changed you and the skeins of fate unravel in your view. Except as noted below, farseers function as sorcerers and use the sorcerer spell list.\n\n#### Blood of the Seer\nWhen you choose this origin at 1st level, the blood of your ancestors signals your destiny. You become proficient in Insight and History. Your preternatural sense of what is to come also allows you to sense imminent danger, so you make initiative checks with advantage.\n\n#### Quickening\nAt 1st level, you can take the Dodge action as a bonus action on your turn. You can do this a number of times equal to your Constitution modifier (minimum of 1). You regain expended uses after finishing a long or short rest.\n\n#### Commune with the Unknown\nUpon reaching 6th level, your prophetic insight allows you to commune with otherworldly powers. By focusing all your attention on a single yes-or-no question for 1 minute, you can pose that question to the powers beyond. The entity that responds to your question has vast knowledge of everything that has happened and of everything that is likely to happen. It isn't omniscient, however; it can predict the future only in terms of what may happen, not what's certain to happen. Questions about the future must be phrased in terms of what's possible or plausible to avoid non-answers. You must finish a short or long rest before communing with the unknown again.\n\n#### Time Slip\nBeginning at 14th level, the skeins of time enshroud your body, distorting the fabric of reality around you. As an action, you can expend 3 sorcery points to step out of sync with probable futures. You can be seen only as an indistinct, shimmery outline. Attacks against you are made with disadvantage and you have resistance against nonmagical bludgeoning, piercing, and slashing damage. Additionally, you can move through other creatures and solid objects as if they were difficult terrain. If you end your turn inside a solid object, you take 5 (1d10) force damage. The effect lasts for 1 minute, provided you maintain concentration on it as on a spell.\n\n#### Sharing the Dream\nAt 18th level, visions of likely futures constantly weave across your consciousness. You can share that foreknowledge with your companions. As an action, you can grant up to five creatures (which can include yourself) advantage on attack rolls or saving throws (each creature chooses for itself) for 1 minute, provided you maintain concentration on this effect as on a spell. You must expend 2 sorcery points per affected creature to trigger this effect."
            }
        ]
    },
    {
        "name": "Wizard",
        "subtypes": [
            {
                "name": "School of Desiderites",
                "desc": "Desiderites seek to alter reality as effortlessly as the jinn. To master the magic of granting wishes, they create and improve a magic lamp that grants a flexibility other wizards rarely achieve. The weakness of wish magic is that someone else must make the wish the desiderite grants. While some desiderites help others, the greedy or power-hungry keep retainers or servants close at hand to make wishes that benefit the wizard.\n\n#### Disciple of Desires\nAt 2nd level when you choose this school, you learn to read, write, and speak Primordial. You craft a brass ring or lamp that serves as an arcane focus for your spells. If this object is destroyed or lost, you can create another one in 1 hour, using a ritual requiring 25 gp worth of components. \nTo use any of the Desiderite subclass features, you must touch your ring or lamp after a mortal creature other than you within 60 feet of you makes a wish. You must be able to see and hear them utter the wish aloud for the magic to take hold.\n\n#### Small Favors\nStarting at 2nd level, you can grant small wishes to others. When a creature makes a wish regarding an action they are about to take, including an attack roll, ability check, or saving throw, you can use your reaction to grant their wish for success by adding 1d4 to the roll. You must use this feature before the creature makes its roll. No creature can benefit from this feature more than three times per day.\nYou can use this feature a number of times equal to your proficiency bonus, and you regain expended uses when you finish a short or long rest. Once you grant a creature's wish three times with this feature, it can't receive another wish from this feature until the next dawn.\nAt 10th level, you add 1d6 instead.\n\n#### Heart's Desire \nStarting at 6th level, you can sense the deepest desires of others. You learn detect thoughts (or another divination spell of your choice if you already know that spell), and you can cast it without components. When you probe deeper into a creature's thoughts, you learn one thing it sincerely wishes for, even if it succeeds on its Wisdom saving throw.\n\n#### Desperate Wish\nBeginning at 10th level, you can answer the wish of an ally in dire need. When a creature you can see and hear within 60 feet of you drops to 0 hit points but is not instantly killed, it can call out to you, and you can use your reaction to cause it to drop to 1 hit point instead, teleport to a space within 5 feet of you, and gain immunity to all damage until the start of its next turn. Once you use this feature, you can't use it again until you finish a long rest or you expend a 5-level spell slot to regain the use of this feature.\n\n#### Wishmaster\nAt 14th level, you can grant most wishes by duplicating the effect of other spells. When a creature makes a wish, you can rub your lamp as an action to grant their wish. You can duplicate any spell, even those you do not know or are not on your spell list, by expending a spell slot two levels higher than the level of the spell you wish to duplicate.\nOnce you use this feature, you can't use it again until you finish a long rest."
            }
        ]
    }
]
